import random
num=random.randint(0,100)
tr=7
print(f"============================\nВтаємо у грі \"Вгадай число\"\n============================\nУ вас є 7 спроб вгадати задумане число\nпісля кожної спроби будуть виводитися підказки")
po=["Ви віддалились(","Не туди..."]
pi=["Уже краще","Ближче","Майже","Так тримати"]
while True:
    a=int(input("\nЩоб почати гру введіть 0,\nЩоб змінити кількість спроб введіть 1\n      :  "))
    if a == 0:
        x1 = int(input("Яке число на вашу думку загадав комп'ютер?\n      :  "))
        
        if num > x1:
            print("Мало")
        elif num < x1:
            print("Забагато")
        else:
            print("З першої спроби! Так, це задумане число ви перемогли!")

        for i in range(1, tr + 1):
            x = int(input("Яке число на вашу думку загадав комп'ютер?\n      :  "))
            
            if x == num:
                print(f"Так, це задумане число ви перемогли! Кількість спроб: {i+1}")
                break
            elif abs(num - x1) < abs(num - x):
                print(random.choice(po))
                x1 = x
            elif abs(num - x1) > abs(num - x):
                print(random.choice(pi))
                x1 = x

            if i == tr:
                print(f"На жаль, ви вичерпали всі спроби. Загадане число було {num}.")
    else:
        tr=int(input("Оберіть кількість спроб  : "))